---
kind: method
id: M:Autodesk.Revit.DB.Structure.EndTreatmentType.CreateDefaultEndTreatmentType(Autodesk.Revit.DB.Document)
source: html/fc539f83-b2dc-57c2-48f1-174588cc1535.htm
---
# Autodesk.Revit.DB.Structure.EndTreatmentType.CreateDefaultEndTreatmentType Method

Creates a new EndTreatmentType object with a default name.

## Syntax (C#)
```csharp
public static ElementId CreateDefaultEndTreatmentType(
	Document ADoc
)
```

## Parameters
- **ADoc** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
The newly created type id.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null